RickMageddon/NRF52840-clipp/Hardware_software/backup/main-withstartandshutdown.cpp
/*
 * PLATFORM: PlatformIO with Seeed XIAO nRF52840
 * LIBRARY: Adafruit Bluefruit nRF52 (native Nordic BLE stack)
 * 
 * Uses FreeRTOS for concurrent BLE, battery monitoring, and button handling
 * Features: Deep sleep power management, boot screen, BLE connection status
 */

#include <Arduino.h>
#include <bluefruit.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <nrf_power.h>

// OLED Display settings (0.91" 128x32 I2C)
#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 32
#define OLED_RESET -1
#define SCREEN_ADDRESS 0x3C
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

// Button pin
const int BUTTON_PIN = D0;

// Power management constants
const unsigned long LONG_PRESS_TIME = 5000;  // 5 seconds for power on/off

// Device states
enum DeviceState {
  STATE_BOOT,           // Showing CLIPP logo
  STATE_NOT_CONNECTED,  // BLE not connected
  STATE_CONNECTED,      // BLE connected, normal operation
  STATE_SHUTDOWN_PROMPT,// Asking user to confirm shutdown
  STATE_SHUTTING_DOWN   // Showing "Shutting Down" before sleep
};

volatile DeviceState deviceState = STATE_BOOT;

// FreeRTOS task handles
TaskHandle_t bleTaskHandle;
TaskHandle_t batteryTaskHandle;
TaskHandle_t buttonTaskHandle;

// Shared battery data (protected by mutex)
SemaphoreHandle_t batteryMutex;
volatile uint16_t sharedBatteryMV = 0;
volatile uint8_t sharedBatteryPercent = 0;

// Shared last message data (protected by mutex)
SemaphoreHandle_t messageMutex;
String lastAppName = "";
String lastSender = "";
String lastMessage = "";

// BLE connection state (updated by callbacks)
volatile bool bleConnected = false;

// BLE Service and Characteristic UUIDs (custom 128-bit)
static BLEUuid SERVICE_UUID("819b2f01-9d7d-42f1-a58e-29e5c07dd6b6");
static BLEUuid RX_CHAR_UUID("5600f473-a667-4c60-b0b1-7c68fbe9720f");
static BLEUuid TX_CHAR_UUID("b2fd3be9-40ca-48cd-80ed-5d04b2a71da2");

// BLE Service and Characteristics
BLEService bleService = BLEService(SERVICE_UUID);
BLECharacteristic rxCharacteristic = BLECharacteristic(RX_CHAR_UUID);
BLECharacteristic txCharacteristic = BLECharacteristic(TX_CHAR_UUID);

// LED Pin - Built-in LED on Seeed XIAO nRF52840 
const int LED_PIN = LED_BUILTIN;

// Buffer for reassembling chunked messages
String messageBuffer = "";
unsigned long lastChunkTime = 0;
const unsigned long CHUNK_TIMEOUT = 1000; // 1 second timeout to complete a message

// Battery monitoring constants
const int BATTERY_BUFFER_SIZE = 8;
uint16_t batteryBuffer[BATTERY_BUFFER_SIZE] = {0};
int batteryBufferIndex = 0;
uint16_t lastReportedBattery = 0;

// Forward declarations
void showBootScreen();
void showNotConnected();
void showShutdownPrompt();
void showShuttingDown();
void enterDeepSleep();

// Read battery voltage using internal VDD measurement (more stable than GPIO ADC)
uint16_t readBatteryVoltage() {
  // Use internal 3.0V reference and measure VDD/4
  // This gives us the actual supply voltage which comes from the battery
  analogReference(AR_INTERNAL_3_0);
  analogReadResolution(12);
  
  // Take multiple samples
  const int numSamples = 16;
  long sum = 0;
  
  for (int i = 0; i < numSamples; i++) {
    // Read from internal VDD channel (PIN_VBAT is defined in variant for nRF52)
    // On XIAO nRF52840, we read the regulated output which tracks battery
    sum += analogRead(PIN_VBAT);
    delayMicroseconds(100);
  }
  
  int rawValue = sum / numSamples;
  
  // Convert to millivolts: (raw / 4096) * 3.0V * 4 (because VDD/4 is measured)
  // = raw * 3000 * 4 / 4096 = raw * 12000 / 4096 = raw * 2.9296875
  uint16_t batteryVoltage = (uint32_t)rawValue * 3000 * 4 / 4096;
  
  // Add to rolling buffer for median filtering
  batteryBuffer[batteryBufferIndex] = batteryVoltage;
  batteryBufferIndex = (batteryBufferIndex + 1) % BATTERY_BUFFER_SIZE;
  
  // Sort buffer and return median to reject outliers
  uint16_t sortedBuffer[BATTERY_BUFFER_SIZE];
  for (int i = 0; i < BATTERY_BUFFER_SIZE; i++) {
    sortedBuffer[i] = batteryBuffer[i];
  }
  
  // Simple bubble sort
  for (int i = 0; i < BATTERY_BUFFER_SIZE - 1; i++) {
    for (int j = 0; j < BATTERY_BUFFER_SIZE - i - 1; j++) {
      if (sortedBuffer[j] > sortedBuffer[j + 1]) {
        uint16_t temp = sortedBuffer[j];
        sortedBuffer[j] = sortedBuffer[j + 1];
        sortedBuffer[j + 1] = temp;
      }
    }
  }
  
  // Return median value
  return sortedBuffer[BATTERY_BUFFER_SIZE / 2];
}

// Function to calculate battery percentage (3.7V LiPo: 4.2V full, 2.8V empty)
uint8_t calculateBatteryPercentage(uint16_t millivolts) {
  const uint16_t MAX_MV = 4200;  // 4.2V fully charged
  const uint16_t MIN_MV = 2800;  // 2.8V cutoff
  
  if (millivolts >= MAX_MV) return 100;
  if (millivolts <= MIN_MV) return 0;
  
  uint8_t percentage = ((millivolts - MIN_MV) * 100) / (MAX_MV - MIN_MV);
  return percentage;
}

// ============== DISPLAY FUNCTIONS ==============

void showBootScreen() {
  display.clearDisplay();
  display.setTextSize(3);
  display.setTextColor(SSD1306_WHITE);
  
  // Center "CLIPP" on display
  int16_t x1, y1;
  uint16_t w, h;
  display.getTextBounds("CLIPP", 0, 0, &x1, &y1, &w, &h);
  display.setCursor((SCREEN_WIDTH - w) / 2, (SCREEN_HEIGHT - h) / 2);
  display.print("CLIPP");
  display.display();
  
  Serial.println("[DISPLAY] Boot screen - CLIPP");
}

void showNotConnected() {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 4);
  display.print("Not Connected");
  display.setCursor(0, 18);
  display.print("Searching...");
  display.display();
  
  Serial.println("[DISPLAY] Not connected");
}

void showShutdownPrompt() {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);
  display.print("Want to shutdown?");
  display.setCursor(0, 12);
  display.print("Long press: No");
  display.setCursor(0, 24);
  display.print("1 click: Yes");
  display.display();
  
  Serial.println("[DISPLAY] Shutdown prompt");
}

void showShuttingDown() {
  display.clearDisplay();
  display.setTextSize(2);
  display.setTextColor(SSD1306_WHITE);
  
  // Center "Shutting Down" on display
  display.setCursor(0, 8);
  display.print("Shutting");
  display.setCursor(30, 24);
  display.print("Down");
  display.display();
  
  Serial.println("[DISPLAY] Shutting down");
}

void enterDeepSleep() {
  Serial.println("[POWER] Entering deep sleep...");
  
