RickMageddon/NRF52840-clipp/Hardware_software/backup/main-withstartandshutdown.cpp
  // Disconnect BLE if connected
  if (Bluefruit.connected()) {
    Bluefruit.disconnect(Bluefruit.connHandle());
  }
  
  // Stop BLE advertising
  Bluefruit.Advertising.stop();
  
  // Clear and turn off display
  display.clearDisplay();
  display.display();
  
  // Turn off LED
  digitalWrite(LED_PIN, LOW);
  
  // Small delay to let everything settle
  delay(100);
  
  // Configure button pin for wake-up (sense LOW level)
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  
  // Configure the button as wake-up source using SENSE
  // nRF52840 can wake from System OFF using GPIO SENSE
  NRF_GPIO->PIN_CNF[g_ADigitalPinMap[BUTTON_PIN]] = 
    (GPIO_PIN_CNF_SENSE_Low << GPIO_PIN_CNF_SENSE_Pos) |
    (GPIO_PIN_CNF_DRIVE_S0S1 << GPIO_PIN_CNF_DRIVE_Pos) |
    (GPIO_PIN_CNF_PULL_Pullup << GPIO_PIN_CNF_PULL_Pos) |
    (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos) |
    (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos);
  
  Serial.println("[POWER] Going to System OFF mode");
  Serial.flush();
  
  // Enter System OFF (lowest power mode, ~0.4µA)
  // Device will reset when button is pressed
  NRF_POWER->SYSTEMOFF = 1;
  
  // Should never reach here
  while(1) { }
}

// ============== FreeRTOS TASKS ==============

// Task: Handle BLE message processing (high priority)
void bleTask(void *pvParameters) {
  (void) pvParameters;
  
  while (1) {
    // Skip if in shutdown states
    if (deviceState == STATE_SHUTDOWN_PROMPT || deviceState == STATE_SHUTTING_DOWN) {
      vTaskDelay(pdMS_TO_TICKS(100));
      continue;
    }
    
    if (Bluefruit.connected()) {
      // Timeout incomplete messages after 1 second of inactivity
      if (messageBuffer.length() > 0 && (millis() - lastChunkTime) > CHUNK_TIMEOUT) {
        
        // Parse message and store for display
        if (messageBuffer.startsWith("CALL:")) {
          // Format: CALL:+1234567890:45s
          int firstColon = messageBuffer.indexOf(":");
          int lastColon = messageBuffer.lastIndexOf(":");
          
          if (firstColon != -1 && lastColon != -1 && firstColon < lastColon) {
            String phoneNumber = messageBuffer.substring(firstColon + 1, lastColon);
            String duration = messageBuffer.substring(lastColon + 1);
            
            // Store for display
            if (xSemaphoreTake(messageMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
              lastAppName = "Call";
              lastSender = phoneNumber;
              lastMessage = "Duration: " + duration;
              xSemaphoreGive(messageMutex);
            }
            
            Serial.print("[CALL] From: ");
            Serial.println(phoneNumber);
          }
        } else if (messageBuffer.startsWith("NOTIF:")) {
          // Format: NOTIF:AppName:Sender:Content or NOTIF:AppName:Title:Content
          int firstColon = messageBuffer.indexOf(":");
          int secondColon = messageBuffer.indexOf(":", firstColon + 1);
          int thirdColon = messageBuffer.indexOf(":", secondColon + 1);
          
          if (firstColon != -1 && secondColon != -1) {
            String appName = messageBuffer.substring(firstColon + 1, secondColon);
            String sender = "";
            String content = "";
            
            if (thirdColon != -1) {
              // Has sender/title and content: NOTIF:App:Sender:Content
              sender = messageBuffer.substring(secondColon + 1, thirdColon);
              content = messageBuffer.substring(thirdColon + 1);
            } else {
              // Just app and content, no sender: NOTIF:App:Content
              content = messageBuffer.substring(secondColon + 1);
              sender = "";
            }
            
            // Clean up app name (remove com. prefix if present)
            if (appName.startsWith("com.")) {
              int lastDot = appName.lastIndexOf(".");
              if (lastDot > 4) {
                appName = appName.substring(lastDot + 1);
              }
            }
            // Capitalize first letter
            if (appName.length() > 0) {
              appName.setCharAt(0, toupper(appName.charAt(0)));
            }
            
            // Store for display
            if (xSemaphoreTake(messageMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
              lastAppName = appName;
              lastSender = sender;
              lastMessage = content;
              xSemaphoreGive(messageMutex);
            }
            
            Serial.print("[NOTIF] ");
            Serial.print(appName);
            Serial.print(": ");
            Serial.println(sender);
          }
        }
        
        messageBuffer = "";
      }
    }
    
    vTaskDelay(pdMS_TO_TICKS(10));  // Check every 10ms
  }
}

// Task: Battery monitoring (low priority, runs every 10 seconds)
void batteryTask(void *pvParameters) {
  (void) pvParameters;
  
  while (1) {
    // Skip if in shutdown states
    if (deviceState == STATE_SHUTDOWN_PROMPT || deviceState == STATE_SHUTTING_DOWN) {
      vTaskDelay(pdMS_TO_TICKS(100));
      continue;
    }
    
    uint16_t batteryMV = readBatteryVoltage();
    
    // Only report if value has changed significantly (dead-band of 30mV)
    if (abs((int)batteryMV - (int)lastReportedBattery) >= 30 || lastReportedBattery == 0) {
      lastReportedBattery = batteryMV;
      uint8_t batteryPercent = calculateBatteryPercentage(batteryMV);
      
      // Update shared battery data (protected by mutex)
      if (xSemaphoreTake(batteryMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        sharedBatteryMV = batteryMV;
        sharedBatteryPercent = batteryPercent;
        xSemaphoreGive(batteryMutex);
      }
      
      Serial.print("[BATTERY] ");
      Serial.print(batteryMV);
      Serial.print("mV (");
      Serial.print(batteryPercent);
      Serial.println("%)");
      
      // Send battery status to app via TX characteristic if connected
      if (Bluefruit.connected()) {
        String batteryStatus = "BATT:" + String(batteryPercent) + "%:" + String(batteryMV) + "mV";
        txCharacteristic.notify(batteryStatus.c_str(), batteryStatus.length());
      }
    }
    
    vTaskDelay(pdMS_TO_TICKS(10000));  // Check every 10 seconds
  }
}

// Task: Button and display handling (medium priority)
void buttonTask(void *pvParameters) {
  (void) pvParameters;
  
  bool lastButtonState = HIGH;
  bool displayActive = false;
  unsigned long displayOnTime = 0;
  const unsigned long DISPLAY_TIMEOUT = 5000;
  
  // Double-click detection
  unsigned long lastClickTime = 0;
  const unsigned long DOUBLE_CLICK_TIME = 400;  // Max time between clicks for double-click
  const unsigned long CLICK_WAIT_TIME = 450;    // Time to wait before processing single click
  bool waitingForSecondClick = false;
  
  // Long press detection for power management
  unsigned long buttonPressStartTime = 0;
  bool buttonHeld = false;
  bool longPressTriggered = false;
  
  // Track previous connection state for display updates
  bool lastBleConnected = false;
  
  while (1) {
    bool currentButtonState = digitalRead(BUTTON_PIN);
    bool currentBleConnected = Bluefruit.connected();
    
    // ============== HANDLE SHUTDOWN PROMPT STATE ==============
    if (deviceState == STATE_SHUTDOWN_PROMPT) {
      // In shutdown prompt - waiting for user response
      
      // Detect button press (falling edge)
      if (currentButtonState == LOW && lastButtonState == HIGH) {
        buttonPressStartTime = millis();
        buttonHeld = true;
        longPressTriggered = false;
      }
      
      // Detect button release
      if (currentButtonState == HIGH && lastButtonState == LOW) {
        if (buttonHeld && !longPressTriggered) {
          // Short press (single click) = Yes, shutdown
          Serial.println("[POWER] User confirmed shutdown");
          deviceState = STATE_SHUTTING_DOWN;
          showShuttingDown();
          delay(1500);  // Show message for 1.5 seconds
          enterDeepSleep();
        }
        buttonHeld = false;
      }
      
      // Check for long press (No, cancel shutdown)
      if (buttonHeld && !longPressTriggered && (millis() - buttonPressStartTime) >= LONG_PRESS_TIME) {
        longPressTriggered = true;
        Serial.println("[POWER] User cancelled shutdown");
        deviceState = currentBleConnected ? STATE_CONNECTED : STATE_NOT_CONNECTED;
        
