RickMageddon/NRF52840-clipp/Hardware_software/backup/main-withstartandshutdown.cpp
        if (!currentBleConnected) {
          showNotConnected();
        } else {
          display.clearDisplay();
          display.display();
          displayActive = false;
        }
      }
      
      lastButtonState = currentButtonState;
      vTaskDelay(pdMS_TO_TICKS(20));
      continue;
    }
    
    // ============== HANDLE BLE CONNECTION STATE CHANGES ==============
    if (currentBleConnected != lastBleConnected) {
      lastBleConnected = currentBleConnected;
      
      if (currentBleConnected) {
        // Just connected
        deviceState = STATE_CONNECTED;
        display.clearDisplay();
        display.display();
        displayActive = false;
        Serial.println("[STATE] Connected");
      } else {
        // Just disconnected
        deviceState = STATE_NOT_CONNECTED;
        showNotConnected();
        displayActive = true;
        displayOnTime = millis();
        Serial.println("[STATE] Disconnected");
      }
    }
    
    // ============== LONG PRESS DETECTION FOR SHUTDOWN ==============
    // Detect button press start (falling edge)
    if (currentButtonState == LOW && lastButtonState == HIGH) {
      buttonPressStartTime = millis();
      buttonHeld = true;
      longPressTriggered = false;
    }
    
    // Check for long press (5 seconds) to trigger shutdown prompt
    if (buttonHeld && !longPressTriggered && (millis() - buttonPressStartTime) >= LONG_PRESS_TIME) {
      longPressTriggered = true;
      deviceState = STATE_SHUTDOWN_PROMPT;
      showShutdownPrompt();
      waitingForSecondClick = false;  // Cancel any pending click detection
    }
    
    // Detect button release
    if (currentButtonState == HIGH && lastButtonState == LOW) {
      buttonHeld = false;
      
      // Only process normal clicks if not a long press
      if (!longPressTriggered && deviceState == STATE_CONNECTED) {
        unsigned long now = millis();
        
        // Check for double-click first (works whether display is on or off)
        if (waitingForSecondClick && (now - lastClickTime) < DOUBLE_CLICK_TIME) {
          // Double-click detected - show battery
          waitingForSecondClick = false;
          
          displayOnTime = millis();
          displayActive = true;
          
          // Get battery data
          uint8_t batteryPercent = 0;
          if (xSemaphoreTake(batteryMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            batteryPercent = sharedBatteryPercent;
            xSemaphoreGive(batteryMutex);
          }
          
          // Show battery on OLED
          display.clearDisplay();
          display.setTextSize(2);
          display.setTextColor(SSD1306_WHITE);
          display.setCursor(0, 0);
          display.print("Battery:");
          display.setCursor(0, 18);
          display.print(batteryPercent);
          display.print("%");
          display.display();
          
          Serial.print("[DOUBLE-CLICK] Battery: ");
          Serial.print(batteryPercent);
          Serial.println("%");
        } else {
          // First click - wait for possible second click
          lastClickTime = now;
          waitingForSecondClick = true;
        }
      }
    }
    
    lastButtonState = currentButtonState;
    
    // ============== SINGLE-CLICK PROCESSING (after wait time) ==============
    if (waitingForSecondClick && (millis() - lastClickTime) >= CLICK_WAIT_TIME) {
      waitingForSecondClick = false;
      
      if (deviceState == STATE_CONNECTED) {
        // If display is on, turn it off (single click dismisses)
        if (displayActive) {
          display.clearDisplay();
          display.display();
          displayActive = false;
          
          // Clear the last message so next single-click shows "No messages"
          if (xSemaphoreTake(messageMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            lastAppName = "";
            lastSender = "";
            lastMessage = "";
            xSemaphoreGive(messageMutex);
          }
          
          Serial.println("[SINGLE-CLICK] Display off - message cleared");
        } else {
          // Display was off - show last message
          displayOnTime = millis();
          displayActive = true;
          
          // Get message data
          String appName = "";
          String sender = "";
          String message = "";
          if (xSemaphoreTake(messageMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            appName = lastAppName;
            sender = lastSender;
            message = lastMessage;
            xSemaphoreGive(messageMutex);
          }
          
          // Show message on OLED
          display.clearDisplay();
          display.setTextSize(1);
          display.setTextColor(SSD1306_WHITE);
          
          if (appName.length() > 0) {
            // Line 1: App: Sender (truncate if needed, max ~21 chars)
            display.setCursor(0, 0);
            String header = appName;
            if (sender.length() > 0) {
              header += ": " + sender;
            }
            if (header.length() > 21) {
              header = header.substring(0, 18) + "...";
            }
            display.print(header);
            
            // Line 2: Message content (truncate with ... if too long)
            display.setCursor(0, 12);
            if (message.length() > 21) {
              message = message.substring(0, 18) + "...";
            }
            display.print(message);
          } else {
            display.setCursor(0, 8);
            display.print("No messages");
          }
          display.display();
          
          Serial.print("[SINGLE-CLICK] ");
          Serial.print(appName);
          Serial.print(": ");
          Serial.println(sender);
        }
      }
    }
    
    // ============== DISPLAY TIMEOUT ==============
    if (deviceState == STATE_CONNECTED && displayActive && (millis() - displayOnTime) >= DISPLAY_TIMEOUT) {
      display.clearDisplay();
      display.display();
      displayActive = false;
      
      // Clear the last message so next single-click shows "No messages"
      if (xSemaphoreTake(messageMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        lastAppName = "";
        lastSender = "";
        lastMessage = "";
        xSemaphoreGive(messageMutex);
      }
      
