RickMageddon/NRF52840-clipp/Hardware_software/backup/main-withstartandshutdown.cpp
      Serial.println("[DISPLAY] Off - message cleared");
    }
    
    vTaskDelay(pdMS_TO_TICKS(20));  // Check button every 20ms
  }
}

// Callback when data is written to RX characteristic
void rx_write_callback(uint16_t conn_hdl, BLECharacteristic* chr, uint8_t* data, uint16_t len) {
  Serial.print("[RX Callback] Received chunk (");
  Serial.print(len);
  Serial.print(" bytes): ");
  
  // Append chunk to buffer
  for (uint16_t i = 0; i < len; i++) {
    messageBuffer += (char)data[i];
  }
  Serial.println(messageBuffer);  // Show accumulated message so far
  
  lastChunkTime = millis();
  
  // Blink LED to indicate reception
  digitalWrite(LED_PIN, LOW);
  delay(50);
  digitalWrite(LED_PIN, HIGH);
}

// Callback when a device connects
void connect_callback(uint16_t conn_handle) {
  Serial.println("Device connected!");
  digitalWrite(LED_PIN, HIGH);
  bleConnected = true;
}

// Callback when a device disconnects
void disconnect_callback(uint16_t conn_handle, uint8_t reason) {
  Serial.println("Device disconnected");
  digitalWrite(LED_PIN, LOW);
  bleConnected = false;
}

void setup() {
  // Initialize Serial for debugging
  Serial.begin(115200);
  // Don't wait for Serial - device should work without USB connected
  delay(100);
  
  Serial.println("\n=== Starting CLIPP ===");
  Serial.println("Service UUID: 819b2f01-9d7d-42f1-a58e-29e5c07dd6b6");
  
  // Initialize LED pin
  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);
  
  // Initialize button with internal pull-up
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  
  // Initialize OLED display
  Wire.begin();
  if (!display.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS)) {
    Serial.println("SSD1306 allocation failed");
  } else {
    Serial.println("OLED display initialized");
  }
  
  // Show boot screen
  deviceState = STATE_BOOT;
  showBootScreen();
  delay(2000);  // Show CLIPP for 2 seconds
  
  // Initialize ADC for internal VDD battery reading
  analogReference(AR_INTERNAL_3_0);  // Use internal 3.0V reference
  analogReadResolution(12);          // 12-bit resolution
  
  // Initialize Bluefruit
  Bluefruit.begin();
  Bluefruit.setTxPower(4);  // Max power
  Bluefruit.setName("CLIPP");
  
  // Set connection callbacks
  Bluefruit.Periph.setConnectCallback(connect_callback);
  Bluefruit.Periph.setDisconnectCallback(disconnect_callback);
  
  // Configure and Start BLE Service
  bleService.begin();
  
  // Configure RX Characteristic (Write)
  rxCharacteristic.setProperties(CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP);
  rxCharacteristic.setPermission(SECMODE_NO_ACCESS, SECMODE_OPEN);
  rxCharacteristic.setMaxLen(244);  // Max payload is 244 bytes (MTU 247 - 3 bytes header)
  rxCharacteristic.setWriteCallback(rx_write_callback);
  rxCharacteristic.begin();
  
  // Configure TX Characteristic (Notify)
  txCharacteristic.setProperties(CHR_PROPS_NOTIFY);
  txCharacteristic.setPermission(SECMODE_OPEN, SECMODE_NO_ACCESS);
  txCharacteristic.setMaxLen(244);  // Match RX max length
  txCharacteristic.begin();
  
  // Start advertising
  Bluefruit.Advertising.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE);
  Bluefruit.Advertising.addTxPower();
  Bluefruit.Advertising.addService(bleService);
  Bluefruit.Advertising.addName();
  Bluefruit.Advertising.restartOnDisconnect(true);
  Bluefruit.Advertising.setInterval(32, 244);    // in unit of 0.625 ms
  Bluefruit.Advertising.setFastTimeout(30);      // seconds
  Bluefruit.Advertising.start(0);                // 0 = Don't stop advertising
  
  Serial.println("BLE advertising as 'CLIPP'...");
  
  // Show not connected screen
  deviceState = STATE_NOT_CONNECTED;
  showNotConnected();
  
  // Create mutexes for shared data
  batteryMutex = xSemaphoreCreateMutex();
  messageMutex = xSemaphoreCreateMutex();
  
  // Take an initial battery reading
  uint16_t initialBattery = readBatteryVoltage();
  sharedBatteryMV = initialBattery;
  sharedBatteryPercent = calculateBatteryPercentage(initialBattery);
  lastReportedBattery = initialBattery;
  
  // Create FreeRTOS tasks
  xTaskCreate(
    bleTask,           // Task function
    "BLE",             // Task name
    256,               // Stack size (words)
    NULL,              // Parameters
    2,                 // Priority (higher = more important)
    &bleTaskHandle     // Task handle
  );
  
  xTaskCreate(
    batteryTask,       // Task function
    "Battery",         // Task name
    256,               // Stack size
    NULL,              // Parameters
    1,                 // Priority (low)
    &batteryTaskHandle // Task handle
  );
  
  xTaskCreate(
    buttonTask,        // Task function
    "Button",          // Task name
    512,               // Stack size (increased for state machine)
    NULL,              // Parameters
    1,                 // Priority (low)
    &buttonTaskHandle  // Task handle
  );
  
  Serial.println("FreeRTOS tasks started");
}

void loop() {
  // Empty - all work is done in FreeRTOS tasks
  // The scheduler handles task switching automatically
  vTaskDelay(pdMS_TO_TICKS(1000));
}
